import os

# Считываем токен из секретных переменных Render
BOT_TOKEN = os.getenv("BOT_TOKEN")

# Список Telegram ID главных админов

# Список редакторов
SUPER_ADMINS = [
    1296008023, "1296008023",
    2025001618, "2025001618",
    5001682268, "5001682268",
    946698283, "946698283",
    1103502365, "1103502365",
    7378486851, "7378486851",
    5153045799, "5153045799",
    6951624098, "6951624098",
    745515835, "745515835",
    5219998161, "5219998161",
    5312762160, "5312762160",
    1267398654, "1267398654",
    5978731538, "5978731538",
    8804794247, "8804794247"
]

# Ссылка на твой GitHub Pages (со слэшем на конце)
WEBAPP_URL = "https://ktawok.github.io/tdr26-mini-app/"

# Группа и ВУЗ
GROUP_NAME = "ТДР-26"
UNIVERSITY = "МГРИ"

# Файл базы данных
DB_NAME = "bot_database.db"
